10/data/attachments/19556506df1d8b16.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Zachary_thousand_Friend_88858_6</nif:username>
            <nif:friendToBeRequested>soap_friends_7a7d4e4f-fd83-4257-a088-faddf684ca2d</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>